app/controllers/users/registrations_controller.rb

UPDATE `users` SET `sign_in_count` = 1, `current_sign_in_at` = '2016-10-11 07:00:35', `last_sign_in_at` = '2016-10-11 07:00:35', `current_sign_in_ip` = '::1', `last_sign_in_ip` = '::1' WHERE `users`.`id` = 3
---
  def create
    super
    @user.update(params[:user])